#include"drawtwo.h"
#include"common.h"

/*
功能：相关页面绘制
作者：李浩宇
最后修改：2020/10/29
*/

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：ga_0
参数传递：无
返回值：无
功能：管理员的上方常驻菜单栏绘制
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void ga_0(void)//管理员的上方常驻菜单栏绘制
{
	setbkcolor(LIGHTMAGENTA);
	setfillstyle(1,RED);
	bar(1,1,638,478);
	setcolor(BLUE);
	rectangle(0,0,639,479);
	line(0,20,639,20);
	puthz(4,2,"管理员状态，请谨慎操作",16,19,WHITE);
	line(320,0,320,20);
	puthz(324,2,"项目列表",16,19,WHITE);
	line(400,0,400,20);
	puthz(404,2,"捐助记录",16,19,WHITE);
	line(480,0,480,20);
	puthz(484,2,"用户信息",16,19,WHITE);
	line(560,0,560,20);
	puthz(570,2,"退出",16,29,WHITE);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：ga_1_1_1
参数传递：int pubtype
返回值：无
功能：管理员的公共物资详情页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void ga_1_1_1(int pubtype)//管理员的公共物资详情页面
{
	FILE *fp;
	int i;
	char pub_str[9][11];
	char goodsname[7][10][10]={
		{
			"儿童","金额","婴儿床","尿片","奶粉","奶瓶","儿童衣物","玩具","营养品","高钙牛奶"
		},
		{
			"老人","金额","保健品","老花镜","老人鞋","助听器","拐杖","应急药品","轮椅","小推车"
		},
		{
			"扶贫","金额","种子","幼畜","肥料","衣物","粮油","抽水泵","打药机","收割机"
		},
		{
			"救灾","金额","帐篷","食物","瓶装水","被褥","灯具","绳索","编织袋","发电机"
		},
		{
			"抗疫","金额","口罩","防护服","消毒液","体温计","呼吸机","护目镜","中药制剂","检测试剂"
		},
		{
			"教育","金额","书籍","文具","纸张","近视镜","黑板","粉笔","桌椅","实验教具"
		},
		{
			"环保","金额","过滤器","垃圾袋","酸碱试剂","化学药剂","树苗","收集瓶","灭火器","动物饲料"
		}
	};
	if((fp=fopen("c:\\donate\\DATABASE\\PUBLIC.dat","rb+"))==NULL)
	{
		printf("CAN`T OPEN FILE");
		delay(5000);
		exit(0);
	}
	fseek(fp,9*11*pubtype*sizeof(char),SEEK_SET);
	fread(pub_str[0],9*11*sizeof(char),1,fp);
	free(fp);
	fclose(fp);
	setfillstyle(1,RED);
	bar(1,21,638,478);
	setcolor(WHITE);
	setfillstyle(1,7);
	settextstyle(0,0,1);
	for(i=0;i<9;i++)
	{
		rectangle(10+(i%2)*300,30+(i/2)*92,290+(i%2)*300,90+(i/2)*92);
		puthz(12+(i%2)*300,32+(i/2)*92,"物资名称：",24,26,WHITE);
		puthz(130+(i%2)*300,32+(i/2)*92,goodsname[pubtype][i+1],24,26,WHITE);
		puthz(12+(i%2)*300,60+(i/2)*92,"库存：",24,26,7);
		outtextxy(120+(i%2)*300,75+(i/2)*92,pub_str[i]);
	}
	setfillstyle(1,WHITE);
	bar(320,390,440,450);
	puthz(325,394,"返回",48,52,8);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：ga_3_0
参数传递：int state
返回值：无
功能：管理员右菜单栏
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void ga_3_0(int state)//管理员右菜单栏
{
	
	setfillstyle(1,RED);
	bar(604,20,639,479);
	setcolor(BLUE);
	rectangle(604,20,639,479);
	puthz(606,26,"上",24,24,WHITE);
	puthz(606,56,"一",24,24,WHITE);
	puthz(606,86,"页",24,24,WHITE);
	line(604,116,639,116);
	puthz(606,122,"编",24,24,WHITE);
	puthz(606,152,"码",24,24,WHITE);
	puthz(606,212,"序",24,24,WHITE);
	line(604,240,639,240);
	switch(state)
	{
		case 1:
		{
			puthz(606,246,"查",24,24,WHITE);
			puthz(606,276,"看",24,24,WHITE);
			puthz(606,306,"封",24,24,WHITE);
			puthz(606,336,"禁",24,24,WHITE);
			break;
		}
		case -1:
		{
			puthz(606,246,"查",24,24,WHITE);
			puthz(606,276,"看",24,24,WHITE);
			puthz(606,306,"正",24,24,WHITE);
			puthz(606,336,"常",24,24,WHITE);
			break;
		}
		default:
		{
			printf("state error!");
			delay(5000);
			break;
		}
	}
	line(604,366,639,366);
	puthz(606,372,"下",24,24,WHITE);
	puthz(606,402,"一",24,24,WHITE);
	puthz(606,432,"页",24,24,WHITE);
	line(421,20,421,479);
	line(495,20,495,479);
	puthz(10,25,"用户名",32,40,WHITE);
	puthz(431,25,"编号",32,40,WHITE);
	puthz(505,25,"状态",32,40,WHITE);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：ga_3_1
参数传递：USER *temp,USER_STR *temp_str
返回值：无
功能：管理员查看详情
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void ga_3_1(USER *temp,USER_STR *temp_str)
{
	int times,i;
	char times_str[6];
	char goodsname[9][10]={
	"香皂","牛奶","洗衣粉","食用油","卷筒纸","热水瓶","电饭锅","电冰箱","面包车"
	};
	setfillstyle(1,RED);
	settextstyle(0,0,3);
	bar(1,21,638,478);
	setcolor(WHITE);
	puthz(50,42-3,"用户名：",32,35,WHITE);
	outtextxy(180,45-3,temp_str->userid);
	puthz(50,110-8,"积分：",24,26,WHITE);
	outtextxy(130,110-8,temp_str->score);
	puthz(50,210-22,"联系方式：",24,26,WHITE);
	outtextxy(180,210-22,temp_str->phone);
	puthz(352,110-8,"用户状态：",24,26,WHITE);
	puthz(50,160-15,"捐助次数：",24,26,WHITE);
	if((temp->times)>=0)
	{
		puthz(480,110-8,"正常",24,26,WHITE);
		outtextxy(180,160-15,temp_str->times);
	}
	else
	{
		times=(temp->times)*(-1)-1;
		itoa(times,times_str,10);
		puthz(480,110-8,"冻结",24,26,WHITE);
		outtextxy(180,160-15,times_str);
	}
	settextstyle(0,0,1);
	puthz(50,220,"兑换过的爱心礼品数量：",16,18,WHITE);
	setcolor(WHITE);
	rectangle(15,238,625,360);
	for(i=0;i<9;i++)
	{
		puthz(20+(i%3)*200,245+(i/3)*40,goodsname[i],16,17,WHITE);
		outtextxy(20+(i%3)*200,265+(i/3)*40,temp_str->goods[i]);
	}
	setfillstyle(1,WHITE);
	bar(10,370,70,470);
	if((temp->times)>=0)//只有此项目未完成时才会绘制捐助按钮
	{
		puthzlimit(16,376,70,"冻结",48,50,2,8);
	}
	else
	{
		puthzlimit(16,376,70,"解封",48,50,2,8);
	}
	return;
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_0
参数传递：无
返回值：无
功能：绘制上方常驻菜单栏
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_0(void)//绘制上方常驻菜单栏
{
	setbkcolor(LIGHTMAGENTA);
	setfillstyle(1,RED);
	bar(1,21,638,478);
	setcolor(BLUE);
	rectangle(0,0,639,479);
	line(0,20,639,20);
	line(80,0,80,20);
	line(160,0,160,20);
	line(240,0,240,20);
	line(320,0,320,20);
	line(400,0,400,20);
	line(480,0,480,20);
	line(560,0,560,20);
	puthz(4,2,"爱心背景",16,19,WHITE);
	puthz(84,2,"我要捐助",16,19,WHITE);
	puthz(164,2,"发起请求",16,19,WHITE);
	puthz(244,2,"捐助记录",16,19,WHITE);
	puthz(324,2,"爱心留言",16,19,WHITE);
	puthz(404,2,"互助商城",16,19,WHITE);
	puthz(484,2,"个人信息",16,19,WHITE);
	puthz(570,2,"公示板",16,19,WHITE);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_0_0
参数传递：int state
返回值：无
功能：绘制右方常驻菜单栏
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_0_0(int state)//绘制右方常驻菜单栏
{
	int i=0;
	setfillstyle(1,RED);
	bar(604,20,639,479);
	setcolor(BLUE);
	rectangle(604,20,639,479);
	puthz(606,26,"上",24,24,WHITE);
	puthz(606,56,"一",24,24,WHITE);
	puthz(606,86,"页",24,24,WHITE);
	line(604,116,639,116);
	puthz(606,122,"时",24,24,WHITE);
	puthz(606,152,"间",24,24,WHITE);
	puthz(606,212,"序",24,24,WHITE);
	line(604,240,639,240);
	puthz(606,246,"种",24,24,WHITE);
	puthz(606,276,"类",24,24,WHITE);
	puthz(606,306,"筛",24,24,WHITE);
	puthz(606,336,"选",24,24,WHITE);
	line(604,366,639,366);
	puthz(606,372,"下",24,24,WHITE);
	puthz(606,402,"一",24,24,WHITE);
	puthz(606,432,"页",24,24,WHITE);
	if(state==2)
	{
		i=40;
	}
	line(421-i,68,421-i,479);
	line(495-i,68,495-i,479);
	return;
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_2_0
参数传递：无
返回值：无
功能：绘制我要捐助表格线
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_2_0(void)//绘制我要捐助表格线
{
	int i=0;
	setfillstyle(1,RED);
	bar(0,20,639,479);
	setcolor(BLUE);
	rectangle(0,20,639,479);
	line(0,68,604,68);
	for(i=0;i<9;i++)
	{
		line(0,109+41*i,604,109+41*i);
	}
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_2_1
参数传递：int *state
返回值：无
功能：绘制种类筛选的窗口
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_2_1(int *state)//绘制种类筛选的窗口
{
	setfillstyle(1,WHITE);
	bar(66,90,179,150);
	bar(245,90,358,150);
	bar(424,90,537,150);
	bar(66,216,179,276);
	bar(245,216,358,276);
	bar(424,216,537,276);
	bar(66,342,179,402);
	bar(245,342,358,402);
	bar(424,342,537,402);
	puthz(66+5,90+5,"儿童",48,53,8);
	puthz(245+5,90+5,"老人",48,53,8);
	puthz(424+5,90+5,"扶贫",48,53,8);
	puthz(66+5,216+5,"救灾",48,53,8);
	puthz(245+5,216+5,"抗疫",48,53,8);
	puthz(424+5,216+5,"教育",48,53,8);
	puthz(66+5,342+5,"环保",48,53,8);
	puthz(245+5,342+5,"全部",48,53,8);
	if(*state==0)
	{
		puthz(424+5,342+5,"已完成",32,37,8);
	}
	if(*state==1)
	{
		puthz(424+5,342+5,"进行中",32,37,8);
	}
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_2_2
参数传递：无
返回值：无
功能：绘制公共项目类型选择
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_2_2(void)//公共项目类型选择
{
	setfillstyle(1,RED);
	bar(1,21,638,478);
	setfillstyle(1,WHITE);
	bar(66,90,179,150);
	bar(245,90,358,150);
	bar(424,90,537,150);
	bar(66,216,179,276);
	bar(245,216,358,276);
	bar(424,216,537,276);
	bar(66,342,179,402);
	puthz(66+5,90+5,"儿童",48,55,BLACK);
	puthz(245+5,90+5,"老人",48,55,BLACK);
	puthz(424+5,90+5,"扶贫",48,55,BLACK);
	puthz(66+5,216+5,"救灾",48,55,BLACK);
	puthz(245+5,216+5,"抗疫",48,55,BLACK);
	puthz(424+5,216+5,"教育",48,55,BLACK);
	puthz(66+5,342+5,"环保",48,55,BLACK);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_2_3
参数传递：int pubtype
返回值：无
功能：绘制公共捐助填写页面画图与写字函数
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_2_3(int pubtype)//公共捐助填写页面画图与写字函数
{
	FILE *fp;
	int i;
	char pub_str[9][11];
	char goodsname[7][10][10]={
		{
			"儿童","金额","婴儿床","尿片","奶粉","奶瓶","儿童衣物","玩具","营养品","高钙牛奶"
		},
		{
			"老人","金额","保健品","老花镜","老人鞋","助听器","拐杖","应急药品","轮椅","小推车"
		},
		{
			"扶贫","金额","种子","幼畜","肥料","衣物","粮油","抽水泵","打药机","收割机"
		},
		{
			"救灾","金额","帐篷","食物","瓶装水","被褥","灯具","绳索","编织袋","发电机"
		},
		{
			"抗疫","金额","口罩","防护服","消毒液","体温计","呼吸机","护目镜","中药制剂","检测试剂"
		},
		{
			"教育","金额","书籍","文具","纸张","近视镜","黑板","粉笔","桌椅","实验教具"
		},
		{
			"环保","金额","过滤器","垃圾袋","酸碱试剂","化学药剂","树苗","收集瓶","灭火器","动物饲料"
		}
	};
	if((fp=fopen("c:\\donate\\DATABASE\\PUBLIC.dat","rb+"))==NULL)
	{
		printf("CAN`T OPEN FILE");
		delay(5000);
		exit(0);
	}
	fseek(fp,9*11*pubtype*sizeof(char),SEEK_SET);
	fread(pub_str[0],9*11*sizeof(char),1,fp);
	free(fp);
	fclose(fp);
	fp=NULL;
	setfillstyle(1,RED);
	bar(1,21,638,478);
	setcolor(WHITE);
	setfillstyle(1,7);
	settextstyle(0,0,1);
	for(i=0;i<9;i++)
	{
		rectangle(10+(i%2)*300,30+(i/2)*92,290+(i%2)*300,90+(i/2)*92);
		puthz(12+(i%2)*300,32+(i/2)*92,goodsname[pubtype][i+1],24,26,8);
		outtextxy(123+(i%2)*300,40+(i/2)*92,pub_str[i]);
		outtextxy(112+(i%2)*300,40+(i/2)*92,":");
		puthz(12+(i%2)*300,60+(i/2)*92,"捐出",24,26,7);
		bar(75+(i%2)*300,60+(i/2)*92,280+(i%2)*300,84+(i/2)*92);
	}
	setfillstyle(1,WHITE);
	bar(320,390,440,450);
	puthz(325,394,"确定",48,52,8);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_2_4
参数传递：PRO *ptemp,PRO_STR *ptemp_str
返回值：无
功能：绘制项目详情页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_2_4(PRO *ptemp,PRO_STR *ptemp_str)//绘制项目详情页面
{
	char goodsname[7][10][10]={
		{
			"儿童","金额","婴儿床","尿片","奶粉","奶瓶","儿童衣物","玩具","营养品","高钙牛奶"
		},
		{
			"老人","金额","保健品","老花镜","老人鞋","助听器","拐杖","应急药品","轮椅","小推车"
		},
		{
			"扶贫","金额","种子","幼畜","肥料","衣物","粮油","抽水泵","打药机","收割机"
		},
		{
			"救灾","金额","帐篷","食物","瓶装水","被褥","灯具","绳索","编织袋","发电机"
		},
		{
			"抗疫","金额","口罩","防护服","消毒液","体温计","呼吸机","护目镜","中药制剂","检测试剂"
		},
		{
			"教育","金额","书籍","文具","纸张","近视镜","黑板","粉笔","桌椅","实验教具"
		},
		{
			"环保","金额","过滤器","垃圾袋","酸碱试剂","化学药剂","树苗","收集瓶","灭火器","动物饲料"
		}
	};
	int type=ptemp->protype,i;
	setfillstyle(1,RED);
	settextstyle(0,0,3);
	bar(1,21,638,478);
	setcolor(WHITE);
	
	puthz(50,42-3,"名称",32,35,WHITE);
	/*outtextxy(140,45-3,ptemp_str->proname);*/
	/*puthz(140,45-3,ptemp_str->proname,16,20,8);*/
	outputhz(140,45-3,540,45-3+40,ptemp_str->proname,WHITE);
	
	puthz(50,110-8,"项目类型",24,26,WHITE);
	puthz(160,110-8,goodsname[type][0],24,26,WHITE);
	/*outputhz(160,110-8,360,110-8+40,goodsname[type][0],WHITE);*/
	
	puthz(252,110-8,"联系方式",24,26,WHITE);
	outtextxy(360,110-8,ptemp_str->call);
	
	puthz(50,160-15,"地址",24,26,WHITE);
	/*outtextxy(104,160-15,ptemp_str->place);*/
	/*puthz(104,160-15,ptemp_str->place,16,20,WHITE);*/
	outputhz(104,160-15,504,160-15+40,ptemp_str->place,WHITE);
	
	puthz(50,210-22,"用户名",24,26,WHITE);
	/*outtextxy(130,210-22,ptemp->manname);*/
	/*puthz(130,210-22,ptemp->manname,16,20,WHITE);*/
	outputhz(130,210-22,330,210-22+40,ptemp->manname,WHITE);
	
	settextstyle(0,0,1);
	puthz(40,220,"所需物资数量：",16,18,WHITE);
	setcolor(WHITE);
	rectangle(15,238,625,360);
	
	for(i=0;i<9;i++)
	{
		puthz(20+(i%3)*200,245+(i/3)*40,goodsname[ptemp->protype][i+1],16,17,WHITE);
		outtextxy(20+(i%3)*200,265+(i/3)*40,ptemp_str->amount[0][i]);
	}
	
	puthz(80,370,"项目详情：",16,18,WHITE);
	rectangle(80,390,636,470);
	/*outputinfo_pro_des(ptemp_str->descri,80,392);*/
	outputhz(80,392,620,470,ptemp_str->descri,WHITE);
	
	setfillstyle(1,WHITE);
	if(ptemp->state==0)//只有此项目未完成时才会绘制捐助按钮
	{
		bar(10,370,70,470);
		puthzlimit(16,376,70,"捐助",48,50,2,8);
	}
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_2_5
参数传递：PRO *ptemp,char mode
返回值：无
功能：显示项目物品数量信息页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_2_5(PRO *ptemp,char mode)//显示项目物品数量信息
{
	int i;
	FILE *fp;
	char strofnumber[30],pub_str[9][11];
	char goodsname[7][10][10]={
		{
			"儿童","金额","婴儿床","尿片","奶粉","奶瓶","儿童衣物","玩具","营养品","高钙牛奶"
		},
		{
			"老人","金额","保健品","老花镜","老人鞋","助听器","拐杖","应急药品","轮椅","小推车"
		},
		{
			"扶贫","金额","种子","幼畜","肥料","衣物","粮油","抽水泵","打药机","收割机"
		},
		{
			"救灾","金额","帐篷","食物","瓶装水","被褥","灯具","绳索","编织袋","发电机"
		},
		{
			"抗疫","金额","口罩","防护服","消毒液","体温计","呼吸机","护目镜","中药制剂","检测试剂"
		},
		{
			"教育","金额","书籍","文具","纸张","近视镜","黑板","粉笔","桌椅","实验教具"
		},
		{
			"环保","金额","过滤器","垃圾袋","酸碱试剂","化学药剂","树苗","收集瓶","灭火器","动物饲料"
		}
	};
	setfillstyle(1,RED);
	bar(1,21,638,478);
	setfillstyle(1,BLUE);
	settextstyle(0,0,1);
	setcolor(WHITE);
	for(i=0;i<9;i++)
	{
		bar(10+(i%2)*300,30+(i/2)*92,290+(i%2)*300,62+(i/2)*92);
		puthz(12+(i%2)*300,32+(i/2)*92,goodsname[ptemp->protype][i+1],24,26,WHITE);
		ltoa(ptemp->amount[1][i],strofnumber,10);
		outtextxy(106-80+(i%2)*300,80+(i/2)*92,strofnumber);
		outtextxy(170-60+(i%2)*300,80+(i/2)*92,"/");
		ltoa(ptemp->amount[0][i],strofnumber,10);
		outtextxy(180-60+(i%2)*300,80+(i/2)*92,strofnumber);
	}
	bar(320,390,435,440);
	puthz(325,394,"确定",48,52,8);
	if(mode=='a')
	{
		if((fp=fopen("c:\\donate\\DATABASE\\PUBLIC.dat","rb+"))==NULL)
		{
			printf("CAN`T OPEN FILE");
			delay(5000);
			exit(0);
		}
		fseek(fp,9*11*(ptemp->protype)*sizeof(char),SEEK_SET);
		fread(pub_str[0],9*11*sizeof(char),1,fp);
		free(fp);
		fclose(fp);
		fp=NULL;
		for(i=0;i<9;i++)
		{
			puthz(106-80+(i%2)*300,92+(i/2)*92,"公共物资池剩余：",16,17,WHITE);
			outtextxy(240-60+(i%2)*300,98+(i/2)*92,pub_str[i]);
		}
	}
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_4_0
参数传递：无
返回值：无
功能：绘制捐助记录表格线
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_4_0(void)//绘制捐助记录表格线
{
	int i=0;
	setcolor(LIGHTRED);
	bar(0,20,639,479);
	setcolor(BLUE);
	rectangle(0,20,639,479);
	line(0,68,604,68);
	for(i=0;i<9;i++)
	{
		line(0,109+41*i,604,109+41*i);
	}
	puthz(5,24,"项目名称",32,36,WHITE);
	puthz(425-40,24,"类型",32,36,WHITE);
	puthz(500-40,24,"捐助者",32,36,WHITE);
	line(421-40,20,421-40,479);
	line(495-40,20,495-40,479);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_4_1
参数传递：无
返回值：无
功能：绘制捐助记录页面的种类选择弹窗
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_4_1(void)//绘制捐助记录页面的种类选择弹窗
{
	setfillstyle(1,WHITE);
	bar(66,90,179,150);
	bar(245,90,358,150);
	bar(424,90,537,150);
	bar(66,216,179,276);
	bar(245,216,358,276);
	bar(424,216,537,276);
	bar(66,342,179,402);
	bar(245,342,358,402);
	bar(424,342,537,402);
	puthz(66+5,90+5,"儿童",48,53,8);
	puthz(245+5,90+5,"老人",48,53,8);
	puthz(424+5,90+5,"扶贫",48,53,8);
	puthz(66+5,216+5,"救灾",48,53,8);
	puthz(245+5,216+5,"抗疫",48,53,8);
	puthz(424+5,216+5,"教育",48,53,8);
	puthz(66+5,342+5,"环保",48,53,8);
	puthz(245+5,342+5,"全部",48,53,8);
	puthz(424+5,342+5,"我的",48,53,8);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_4_2
参数传递：long int recordsite
返回值：无
功能：展示捐助记录详情信息
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_4_2(long int recordsite)//展示捐助记录详情信息 
{
	int i;
	long int size;
	RECORD temp;
	RECORD_STR temp_str;
	FILE *fp;
	char strofnumber[15];
	char goodsname[7][10][10]={
		{
			"儿童","金额","婴儿床","尿片","奶粉","奶瓶","儿童衣物","玩具","营养品","高钙牛奶"
		},
		{
			"老人","金额","保健品","老花镜","老人鞋","助听器","拐杖","应急药品","轮椅","小推车"
		},
		{
			"扶贫","金额","种子","幼畜","肥料","衣物","粮油","抽水泵","打药机","收割机"
		},
		{
			"救灾","金额","帐篷","食物","瓶装水","被褥","灯具","绳索","编织袋","发电机"
		},
		{
			"抗疫","金额","口罩","防护服","消毒液","体温计","呼吸机","护目镜","中药制剂","检测试剂"
		},
		{
			"教育","金额","书籍","文具","纸张","近视镜","黑板","粉笔","桌椅","实验教具"
		},
		{
			"环保","金额","过滤器","垃圾袋","酸碱试剂","化学药剂","树苗","收集瓶","灭火器","动物饲料"
		}
	};
	size=sizeof(RECORD_STR);
	if((fp=fopen("c:\\donate\\DATABASE\\RECORD.dat","rb+"))==NULL)
	{
		printf("CAN`T OPEN FILE");
		delay(500);
		exit(0);
	}
	fseek(fp,size*recordsite,SEEK_SET);
	fread(&temp_str,size,1,fp);
	free(fp);
	fclose(fp);
	RECORD_aton(&temp,&temp_str);
	setfillstyle(1,RED);
	bar(1,21,638,478);
	setcolor(WHITE);
	settextstyle(0,0,2);
	
	puthz(50,42,"项目名：",32,34,WHITE);
	//puthz(175,50,temp.proname,24,26,8);
	/*outtextxy(170,50,temp_str.proname);*/
	outputhz(170,50,540,50+40,temp_str.proname,WHITE);
	
	puthz(50,110,"项目类型：",24,26,WHITE);
	puthz(180,110,goodsname[temp.protype][0],24,26,WHITE);
	
	puthz(50,150,"捐助者：",24,26,WHITE);
	//puthz(180,210,temp.userid,24,26,8);
	outtextxy(150,154,temp.userid);
	
	puthz(50,208,"捐出的物资数量",24,26,WHITE);
	rectangle(15,238,625,360);
	settextstyle(0,0,1);
	for(i=0;i<9;i++)//输出项目信息 
	{
		puthz(20+(i%3)*200,245+(i/3)*40,goodsname[temp.protype][i+1],16,17,8);
		outtextxy(20+(i%3)*200,265+(i/3)*40,temp_str.amount[i]);
	}
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_6_0
参数传递：USER *u
返回值：无
功能：爱心商城商品页面绘制
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_6_0(USER *u)//爱心商城商品页面绘制 
{
	char goodname[9][10]={
	"香皂","牛奶","洗衣粉","食用油","卷筒纸","热水瓶","电饭锅","电冰箱","面包车"
	};
	char str_of_number[20];
	int i;
	long int price[9]={100,300,600,800,500,1000,10000,40000,500000}; 
	setcolor(RED);
	settextstyle(0,0,1);
	setfillstyle(1,WHITE);
	puthz(200,25,"互助商城",32,40,WHITE);
	for(i=0;i<9;i++)
	{
		bar(20+200*(i%3),110+110*(i/3),210+200*(i%3),210+110*(i/3));
		puthz(23+200*(i%3),120+110*(i/3),goodname[i],32,35,8);
		puthz(130+200*(i%3),113+110*(i/3),"已拥有",24,28,BLUE);
		puthz(130+200*(i%3),113+110*(i/3)+32,"的数量",24,28,BLUE);
		ltoa(price[i],str_of_number,10);
		outtextxy(23+200*(i%3),183+110*(i/3),str_of_number);
		ltoa(u->goods[i],str_of_number,10);
		outtextxy(133+200*(i%3),183+110*(i/3),str_of_number);
	}
	setcolor(RED);
	line(130,110,130,478);
	line(330,110,330,478);
	line(530,110,530,478);
	line(2,170,638,170);
	line(2,280,638,280);
	line(2,390,638,390);
	
	ltoa(u->score,str_of_number,10);
	bar(400,25,620,80);
	puthz(440,28,"我的积分数",24,26,8);
	outtextxy(410,60,str_of_number);
	
	puthz(100,440,"点击商品名称进行兑换",16,18,WHITE);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_6_1
参数传递：USER *u,int order
返回值：无
功能：兑换商品确认栏
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_6_1(USER *u,int order)//兑换商品确认栏
{
	long int price[9]={100,300,600,800,500,1000,10000,40000,500000}; 
	char str_of_number[20];
	char goodname[9][10]={
	"香皂","牛奶","洗衣粉","食用油","卷筒纸","热水瓶","电饭锅","电冰箱","面包车"
	};
	setfillstyle(1,8);
	bar(178,178,462,364);
	setfillstyle(1,BLUE);
	settextstyle(0,0,2);
	setcolor(RED);
	bar(180,180,460,362);
	puthz(240,200,"即将兑换",16,20,WHITE);
	puthz(320,190,goodname[order],24,30,RED);
	puthz(240,220,"消耗积分",16,20,WHITE);
	ltoa(price[order],str_of_number,10);
	outtextxy(330,220,str_of_number);
	ltoa((*u).score-price[order],str_of_number,10);
	puthz(240,250,"兑换后剩余积分",16,20,WHITE);
	outtextxy(240,280,str_of_number);
	
	setcolor(GREEN);
	setfillstyle(1,RED);
	bar(320,300,415,352);
	puthz(330,310,"确认",32,40,WHITE);
	rectangle(440,180,460,200);
	line(440,180,460,200);
	line(460,180,440,200);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_6_2
参数传递：无
返回值：无
功能：弹出积分不足提示
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_6_2(void)//弹出积分不足提示 
{
	setfillstyle(1,8); 
	bar(180,180,460,300);
	setfillstyle(1,WHITE);
	bar(185,185,455,295);
	puthz(220,200,"积分不足",48,52,RED);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_6_3
参数传递：无
返回值：无
功能：兑换成功提示
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_6_3(void)//兑换成功提示 
{
	setfillstyle(1,8); 
	bar(180,180,460,362);
	setfillstyle(1,WHITE);
	bar(185,185,455,357);
	puthz(220,200,"兑换成功",48,52,RED);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_6_4
参数传递：无
返回值：无
功能：持有量过多提示
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_6_4(void)//持有量过多提示
{
	setfillstyle(1,8); 
	bar(180,180,460,300);
	setfillstyle(1,WHITE);
	bar(185,185,455,295);
	puthz(190,200,"已兑换数额达到上限",48,52,RED);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_7_0
参数传递：USER *u
返回值：无
功能：个人信息
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_7_0(USER *u)//个人信息
{
	int i,judge=1;
	char str_of_number[20];
	char achieve[12][10]={
		"初出茅庐","慷慨解囊","好事成双","慈悲为怀","活佛再世","至德天尊",
		"仓鼠飞轮","大爱无疆","亚圣之风","森林妖精","携手并进","选择恐惧"
	};
	setfillstyle(1,RED);
	bar(1,21,638,478);
	setfillstyle(1,WHITE);
	setcolor(WHITE);
	settextstyle(0,0,3);
	settextjustify(LEFT_TEXT, TOP_TEXT);
	
	bar(10,30,130,80);
	puthz(15,38,"用户名",32,38,8);
	outtextxy(135,40,u->userid);
	
	bar(10,90,180,140);
	puthz(15,95,"联系方式",32,39,8);
	outtextxy(185,100,u->phone);
	
	settextstyle(0,0,2);
	bar(10,150,90,200);
	puthz(15,155,"积分",32,38,8);
	ltoa(u->score,str_of_number,10);
	outtextxy(100,165,str_of_number);
	
	bar(340,150,510,200);
	puthz(343,155,"捐助次数",32,34,8);
	itoa(u->times,str_of_number,10);
	outtextxy(514,165,str_of_number);
	
	bar(450,40,580,80);
	puthz(455,45,"退出账号",24,30,8);
	
	rectangle(20,250,620,460);
	puthz(20,220,"我的成就",24,26,WHITE);
	for(i=0;i<12;i++)
	{
		bar(20+30+200*(i%3),250+10+50*(i/3),20+170+200*(i%3),250+50+50*(i/3));
		if((u->achi/judge)%2==1)//此成就已达成
		{
			puthz(50+10+200*(i%3),260+10+50*(i/3),achieve[i],24,25,8);
		}
		else
		{
			puthz(50+10+14+200*(i%3),260+10+50*(i/3),"未解锁",24,25,8);
		}
		judge*=2;
	}
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_7_1
参数传递：type
返回值：无
功能：个人信息
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_7_1(int type)
{
	char achieve[12][10]={
		"初出茅庐","慷慨解囊","好事成双","慈悲为怀","活佛再世","至德天尊",
		"仓鼠飞轮","大爱无疆","亚圣之风","森林妖精","携手并进","选择恐惧"
	};
	char achi_descri[12][30]={
		"第一次发起捐助请求",
		"第一次进行捐助",
		"累计捐助两次",
		"累计捐助十次",
		"累计捐助五十次",
		"累计捐助一百次",
		"积分积累超过一千万",
		"对抗疫或救灾项目进行捐助",
		"对老人或儿童项目进行捐助",
		"对环保项目及进行捐助",
		"对扶贫或教育项目进行捐助",
		"对公共项目进行捐助"
	};
	setfillstyle(1,8);
	bar(170-5,200-5,480+5,310+5);
	setfillstyle(1,BLUE);
	bar(170,200,480,310);
	setfillstyle(1,8);
	bar(460-5,200,460,220+5);
	bar(460,220,480,220+5);
	setcolor(8);
	line(460,200,480,220);
	line(480,200,460,220);
	if(type==12)
	{
		puthz(200,250,"成就未解锁",32,34,WHITE);
	}
	else
	{
		puthz(190,210,achieve[type],24,25,WHITE);
		puthzlimit(190,238,470,achi_descri[type],24,25,4,WHITE);
	}
	return;
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_8
参数传递：USER *u
返回值：无
功能：绘制是否退出的弹窗
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_8(void)//绘制是否退出的弹窗
{
	setbkcolor(DARKGRAY);
	bar(139,140,455,360);
	setcolor(YELLOW);
	rectangle(139,140,455,360);
	rectangle(223,180,381,240);
	puthz(230,195,"退出",32,90,8);
	rectangle(223,260,381,320);
	puthz(230,275,"取消",32,90,8);
}
