#include"drawone.h"
#include"common.h"

/*
功能：页面绘制
作者：钱力晖
最后修改：2020/10/29
*/

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_1
参数传递：无
返回值：无
功能：绘制首页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_1(void)
{
	setbkcolor(LIGHTRED);
	setcolor(WHITE);
	rectangle(80,80,560,160);
	puthz(100,100,"物资捐赠与发放系统",48,50,WHITE);
	
	rectangle(30,300,180,360);
	puthz(55,310,"登陆",32,80,WHITE);
	
	rectangle(460,300,610,360);
	puthz(470,310,"关于我们",32,35,WHITE);
	
	rectangle(605,5,635,35);
	line(610,10,630,30);
	line(630,10,610,30);
}


/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_1_1
参数传递：无
返回值：无
功能：绘制身份选择页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_1_1(void)
{
	cleardevice();
	setbkcolor(LIGHTRED);
	setcolor(WHITE);
	rectangle(160,60,480,420);
	puthz(240,100,"选择身份",32,50,WHITE);
	rectangle(240,170,400,220);
	puthz(285,180,"个人",32,40,WHITE);
	rectangle(240,260,400,310);
	puthz(285,270,"团体",32,40,WHITE);
	rectangle(240,350,400,400);
	puthz(270,360,"管理员",32,35,WHITE);
	
	rectangle(605,5,635,35);
	LineThick(610,10,630,30,WHITE,3,1);
	LineThick(630,10,610,30,WHITE,3,1);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_1_2
参数传递：无
返回值：无
功能：绘制登陆页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_1_2(void)
{
	cleardevice();
	setbkcolor(LIGHTBLUE);
	
	setfillstyle(SOLID_FILL, WHITE);
	bar(60,100,130,150);
	bar(135,100,540,150);
	puthz(65,115,"账号",24,40,BLACK);
	
	bar(60,250,130,300);
	bar(135,250,540,300);
	puthz(65,265,"密码",24,40,BLACK);
	
	Linex(250,335,360,335,WHITE);
	puthz(260,315,"忘记密码？",16,20,WHITE);
	
	setfillstyle(SOLID_FILL, LIGHTGRAY);
	bar(110,370,260,450);
	puthz(130,390,"登陆",32,80,WHITE);
	
	setfillstyle(SOLID_FILL, LIGHTGRAY);
	bar(380,370,530,450);
	puthz(400,390,"注册",32,80,WHITE);
		
	rectangle(605,5,635,35);
	LineThick(610,10,630,30,WHITE,3,1);
	LineThick(630,10,610,30,WHITE,3,1);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_1_2_0
参数传递：无
返回值：无
功能：绘制管理员登陆页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_1_2_0(void)
{
	cleardevice();
	setbkcolor(LIGHTBLUE);
	
	setfillstyle(SOLID_FILL, WHITE);
	bar(60,100,130,150);
	bar(135,100,540,150);
	puthz(65,110,"账号",24,40,BLACK);
	
	bar(60,250,130,300);
	bar(135,250,540,300);
	puthz(65,260,"密码",24,40,BLACK);
	
	setfillstyle(SOLID_FILL, LIGHTGRAY);
	bar(230,370,390,450);
	puthz(250,390,"登陆",32,80,WHITE);
		
	rectangle(605,5,635,35);
	LineThick(610,10,630,30,WHITE,3,1);
	LineThick(630,10,610,30,WHITE,3,1);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_1_2_1
参数传递：无
返回值：无
功能：绘制封禁页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_1_2_1(void)
{
	setfillstyle(SOLID_FILL, YELLOW);
	bar(150,180,500,330);
	puthz(190,205,"您的账号存在风险，已被暂时封禁",16,20,8);
	puthz(300,235,"如需解封",16,20,8);
	puthz(180,265,"请在七个工作日内联系管理员！",16,20,8);
	puthz(210,295,"将在三秒后返回登陆界面",16,20,8);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_1_3
参数传递：无
返回值：无
功能：绘制注册页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_1_3(void)
{
	cleardevice();
	//画登陆小人
	setcolor(LIGHTBLUE);
	setfillstyle(1, LIGHTBLUE);
	fillellipse(320, 40, 25, 25);//椭圆填充函数，x，y为圆心，x1，y1为x轴半径与y轴半径
	setfillstyle(1, WHITE);
	pieslice(320, 40, 230, 310, 25);//扇形函数，x，y为圆心，stangle与endangle为角度范围（角度制），radius为半径
	fillellipse(320, 35, 12, 12);
	setcolor(WHITE);
	circle(320, 35, 12);		

	setbkcolor(CYAN);

	setfillstyle(SOLID_FILL, WHITE);
	bar(60,80,130,120);
	bar(135,80,540,120);
	puthz(65,85,"账号",24,40,BLACK);

	bar(60,140,130,180);
	bar(135,140,540,180);
	puthz(65,145,"密码",24,40,BLACK);

	bar(60,200,130,240);
	bar(135,200,540,240);
	puthz(65,205,"确认",24,40,BLACK);

	bar(60,260,130,300);
	bar(135,260,540,300);
	puthz(65,265,"电话",24,40,BLACK);
	
	bar(60,320,130,360);
	bar(135,320,540,360);
	puthz(65,325,"验证",24,40,BLACK);
		
	setfillstyle(SOLID_FILL, LIGHTGRAY);
	bar(240,380,410,450);
	puthz(265,390,"注册",48,60,BLACK);

	rectangle(605,5,635,35);
	LineThick(610,10,630,30,WHITE,3,1);
	LineThick(630,10,610,30,WHITE,3,1);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_1_4
参数传递：无
返回值：无
功能：绘制忘记密码页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_1_4(void)
{
	cleardevice();
	setbkcolor(CYAN);

	setfillstyle(SOLID_FILL, WHITE);
	bar(60,80,130,120);
	bar(135,80,540,120);
	puthz(65,85,"账号",24,40,BLACK);

	bar(60,160,130,200);
	bar(135,160,540,200);
	puthz(65,165,"电话",24,40,BLACK);

	bar(60,240,130,280);
	bar(135,240,540,280);
	puthz(65,245,"新密码",16,20,BLACK);

	bar(60,320,130,360);
	bar(135,320,540,360);
	puthz(65,325,"确认",24,40,BLACK);
	
	setfillstyle(SOLID_FILL, LIGHTGRAY);
	bar(240,380,410,450);
	puthz(270,390,"修改",48,50,WHITE);

	rectangle(605,5,635,35);
	LineThick(610,10,630,30,WHITE,3,1);
	LineThick(630,10,610,30,WHITE,3,1);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_1
参数传递：无
返回值：无
功能：绘制爱心背景页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_1(void)//绘制爱心背景页面
{
	putbmp(0,22,"c:\\donate\\PICTURE\\heart.bmp");//图片位置与文件路径
	
	setbkcolor(LIGHTMAGENTA);
	puthz(270,35,"爱心背景",48,50,RED);
	
	puthz(70,120,"人",32,24,8);
	puthz(70,160,"间",32,24,8);
	puthz(70,200,"自",32,24,8);
	puthz(70,280,"有",32,24,8);
	puthz(70,330,"真",32,24,8);
	puthz(70,380,"情",32,24,8);
	puthz(70,430,"在",32,24,8);
	
	puthz(570,120,"爱",32,24,8);
	puthz(570,160,"心",32,24,8);
	puthz(570,200,"捐",32,24,8);
	puthz(570,280,"款",32,24,8);
	puthz(570,330,"暖",32,24,8);
	puthz(570,380,"人",32,24,8);
	puthz(570,430,"心",32,24,8);
	
	puthz(120,130,"中国慈善思想和慈善",16,20,8);
	puthz(400,130,"活动源远流长",16,20,8);
	puthz(120,170,"早在原始社会，有关人类社会福利的思想就产生了",16,20,8);
	puthz(120,190,"中国当代的慈善事业是在上世纪复兴与发展起来的",16,20,8);
	puthz(130,210,"中华慈善总会创立后，慈善活动也频频开展起来",16,20,8);
	puthz(120,230,"现代中国的慈善事业是建立在社会主义基础之上的",16,20,8);
	puthz(120,250,"其思想随着社会主义的建立和完善呈现出阶段性特点",16,20,8);
	puthz(120,270,"并最终形成具有中国特色的社会主义慈善福利思想",16,20,8);
	puthz(160,290,"社会的发展和繁荣离不开每个人的爱心",16,20,8);
	/*puthz(130,310,"让我们伸出温暖的手，播撒爱心，种植善意!",16,20,8);*/
	puthz(150,310,"您的每一次捐赠，都将化成一屡屡阳光",16,20,8);
	puthz(260,330,"愿我们的点滴付出",16,20,8);
	puthz(260,350,"凝聚成爱心的彩虹",16,20,8);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_3_0
参数传递：无
返回值：无
功能：绘制发起请求界面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_3_0(void)//绘制发起请求界面
{
	int polypoints[8]={170,110,170,130,190,120,170,110};
	setbkcolor(LIGHTGREEN);
	
	rectangle(5,5,145,45);
	rectangle(150,5,570,45);
	puthz(20,20,"项目名称",24,25,8);

	rectangle(5,50,145,90);
	rectangle(150,50,570,90);
	puthz(20,65,"捐赠地址",24,25,8);
	
	rectangle(5,95,145,135);
	rectangle(150,95,200,135);
	puthz(20,110,"捐赠类型",24,25,8);

	setfillstyle(SOLID_FILL,WHITE);
	fillpoly(4,polypoints);
	
	rectangle(320,95,430,135);
	puthz(325,100,"选择物资",24,25,8);
	
	rectangle(320,145,460,185);
	rectangle(465,145,630,185);
	puthz(330,155,"发起人姓名",24,25,8);
	
	rectangle(10,160,90,200);
	rectangle(10,200,630,400);
	puthz(20,170,"详情",24,25,8);
	
	rectangle(420,410,539,460);
	puthz(435,415,"发起",48,50,8);
	
	rectangle(90,420,110,440);
	puthz(115,420,"我已阅读并同意",16,17,8);
	puthz(115+120,420,"该条款",16,20,RED);
	setlinestyle(SOLID_LINE,0,THICK_WIDTH);
	line(115+120,440,115+175,440);
	
	rectangle(605,5,635,35);
	LineThick(610,10,630,30,WHITE,3,1);
	LineThick(630,10,610,30,WHITE,3,1);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_3_1
参数传递：无
返回值：无
功能：绘制发起请求类型页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_3_1(void)//请求类型页面
{
	rectangle(210,95,295,197);
	
	rectangle(215,100,250,120);
	puthz(218,103,"儿童",16,17,WHITE);
	
	rectangle(215,125,250,145);
	puthz(218,128,"老人",16,17,WHITE);
	
	rectangle(215,150,250,170);
	puthz(218,153,"扶贫",16,17,WHITE);
	
	rectangle(255,100,290,120);
	puthz(258,103,"救灾",16,17,WHITE);
	
	rectangle(255,125,290,145);
	puthz(258,128,"抗疫",16,17,WHITE);
	
	rectangle(255,150,290,170);
	puthz(258,153,"教育",16,17,WHITE);
	
	rectangle(235,175,270,195);
	puthz(240,178,"环保",16,17,WHITE);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_3_2
参数传递：无
返回值：无
功能：选择物资页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_3_2(int protype)//选择物资页面
{
	setfillstyle(SOLID_FILL, WHITE);
	puthz(190,5,"选择捐赠物资数量",32,30,WHITE);
	puthz(120,40,"注意：此页面显示的物资类型由您选择的捐赠种类决定",16,17,RED);
	
	rectangle(20,70,115,102);
	rectangle(115,70,320,102);

	rectangle(20,142,115,174);
	rectangle(115,142,320,174);
	
	rectangle(20,214,115,246);
	rectangle(115,214,320,246);
	
	rectangle(20,306,115,338);
	rectangle(115,306,320,338);
	
	rectangle(20,398,115,430);
	rectangle(115,398,320,430);
	
	rectangle(340,70,435,102);
	rectangle(435,70,630,102);
	
	rectangle(340,142,435,174);
	rectangle(435,142,630,174);
	
	rectangle(340,214,435,246);
	rectangle(435,214,630,246);
	
	rectangle(340,306,435,338);
	rectangle(435,306,630,338);
	
	rectangle(380,390,500,460);
	puthz(395,400,"确认",48,40,8);

	switch(protype)
	{
		case 0:
		puthz(25,75,"金额",16,17,8);
		puthz(25,147,"婴儿床",16,17,8);
		puthz(25,219,"尿片",16,17,8);
		puthz(25,311,"奶粉",16,17,8);
		puthz(25,403,"奶瓶",16,17,8);
		puthz(345,75,"儿童衣物",16,17,8);
		puthz(345,147,"玩具",16,17,8);
		puthz(345,219,"营养品",16,17,8);
		puthz(345,311,"高钙牛奶",16,17,8);
		break;
		
		case 1:
		puthz(25,75,"金额",16,17,8);
		puthz(25,147,"保健品",16,17,8);
		puthz(25,219,"老花镜",16,17,8);
		puthz(25,311,"老人鞋",16,17,8);
		puthz(25,403,"助听器",16,17,8);
		puthz(345,75,"拐杖",16,17,8);
		puthz(345,147,"应急药品",16,17,8);
		puthz(345,219,"轮椅",16,17,8);
		puthz(345,311,"小推车",16,17,8);
		break;
	
		case 2:
		puthz(25,75,"金额",16,17,8);
		puthz(25,147,"种子",16,17,8);
		puthz(25,219,"幼畜",16,17,8);
		puthz(25,311,"肥料",16,17,8);
		puthz(25,403,"衣物",16,17,8);
		puthz(345,75,"粮油",16,17,8);
		puthz(345,147,"抽水泵",16,17,8);
		puthz(345,219,"打药机",16,17,8);
		puthz(345,311,"收割机",16,17,8);
		break;
	
		case 3:
		puthz(25,75,"金额",16,17,8);
		puthz(25,147,"帐篷",16,17,8);
		puthz(25,219,"食物",16,17,8);
		puthz(25,311,"瓶装水",16,17,8);
		puthz(25,403,"被褥",16,17,8);
		puthz(345,75,"灯具",16,17,8);
		puthz(345,147,"绳索",16,17,8);
		puthz(345,219,"编织袋",16,17,8);
		puthz(345,311,"发电机",16,17,8);
		break;
	
		case 4:
		puthz(25,75,"金额",16,17,8);
		puthz(25,147,"口罩",16,17,8);
		puthz(25,219,"防护服",16,17,8);
		puthz(25,311,"消毒液",16,17,8);
		puthz(25,403,"体温计",16,17,8);
		puthz(345,75,"呼吸机",16,17,8);
		puthz(345,147,"护目镜",16,17,8);
		puthz(345,219,"中药制剂",16,17,8);
		puthz(345,311,"检测试剂",16,17,8);
		break;
		
		case 5:
		puthz(25,75,"金额",16,17,8);
		puthz(25,147,"书籍",16,17,8);
		puthz(25,219,"文具",16,17,8);
		puthz(25,311,"纸张",16,17,8);
		puthz(25,403,"近视镜",16,17,8);
		puthz(345,75,"黑板",16,17,8);
		puthz(345,147,"粉笔",16,17,8);
		puthz(345,219,"桌椅",16,17,8);
		puthz(345,311,"实验教具",16,17,8);
		break;

		case 6:
		puthz(25,75,"金额",16,17,8);
		puthz(25,147,"过滤器",16,17,8);
		puthz(25,219,"垃圾袋",16,17,8);
		puthz(25,311,"酸碱试剂",16,17,8);
		puthz(25,403,"化学药剂",16,17,8);
		puthz(345,75,"树苗",16,17,8);
		puthz(345,147,"收集瓶",16,17,8);
		puthz(345,219,"灭火器",16,17,8);
		puthz(345,311,"动物饲料",16,17,8);
		break;
	}
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_3_3
参数传递：无
返回值：无
功能：相关条款页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_3_3(void)//相关条款页面
{
	puthz(190,5,"云慈善项目发起条款",32,30,8);
	puthz(10,40,"项目发起人须对提交资料的真实性负责，不得虚构事实或者隐瞒真相。",16,20,8);
	puthz(10,57,"平台将重点打击违法诈骗行为，涉及刑事责任的，平台将主动移交资料",16,20,8);
	puthz(10,74,"至公安机关立案。",16,20,8);
	puthz(10,96,"项目发起须知：",24,30,8);
	puthz(10,130,"具有下列情形之一，可依照刑法诈骗财物罪的规定酌情从严惩处：",16,20,8);
	puthz(10,147,"一、通过发送短信和拨打电话或者利用互联网、广播电视、报刊杂志等",16,20,8);
	puthz(10,164,"发布虚假信息，对不特定多数人实施诈骗的",16,20,8);
	puthz(10,181,"二、诈骗救灾和抢险、防汛、优抚、扶贫、移民、救济、医疗款物的",16,20,8);
	puthz(10,198,"三、以振灾募捐名义实施诈骗的",16,20,8);
	puthz(10,215,"四、诈骗残疾人、老年人或者丧失劳动能力人的财物的",16,20,8);
	puthz(10,235,"项目发起人资格：",24,30,8);
	puthz(10,260,"一、十八周岁以上",16,20,8);
	puthz(10,277,"二、中华人民共和国公民",16,20,8);
	puthz(10,294,"三、拥有能够在中国地区接受人民币汇款的银行卡账户",16,20,8);
	puthz(10,310,"发起人承诺书：",32,30,8);
	puthz(10,350,"涉及本项目的相关信息完全真实、有效。本人收到的全部救助款项将直接用于被救助人的救助。若发起人存在违法行为，愿自行承担全部法律责任。",16,20,8);
	rectangle(240,425,400,475);
	puthz(260,435,"我已阅读",32,30,8);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_3_4
参数传递：无
返回值：无
功能：发起成功提示页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_3_4(void)//发起成功提示页面
{
	rectangle(30,120,580,220);
	puthz(50,140,"您的项目发起成功！祝您早日渡过难关",32,30,8);
	puthz(215,180,"页面将在三秒后返回",24,20,8);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_5_0
参数传递：无
返回值：无
功能：绘制留言查看页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_5_0(void)
{
	int i;
	setcolor(WHITE);
	setbkcolor(LIGHTBLUE);
	setlinestyle(SOLID_LINE,0,THICK_WIDTH);
	for(i=1;i<=3;i++)
	{
		line(0,120*i,640,120*i);
	}
	rectangle(50,420,150,460);
	rectangle(260,420,390,460);
	rectangle(490,420,590,460);
	puthz(55,425,"上一页",32,30,8);
	puthz(265,425,"我要留言",32,30,8);
	puthz(495,425,"下一页",32,30,8);
	
	rectangle(605,5,635,35);
	LineThick(610,10,630,30,WHITE,3,1);
	LineThick(630,10,610,30,WHITE,3,1);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_5_1
参数传递：无
返回值：无
功能：绘制留言发起页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_5_1(void)
{
	setbkcolor(WHITE);
	setfillstyle(SOLID_FILL, WHITE);
	rectangle(20,20,100,60);
	rectangle(105,20,580,60);
	puthz(25,25,"姓名",24,25,8);
	
	rectangle(20,80,80,125);
	rectangle(20,125,635,400);
	puthz(25,85,"留言",24,25,8);
	
	rectangle(270,420,370,470);
	puthz(275,425,"确认",24,25,8);
	
	rectangle(605,5,635,35);
	LineThick(610,10,630,30,WHITE,3,1);
	LineThick(630,10,610,30,WHITE,3,1);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_5_2
参数传递：无
返回值：无
功能：绘制留言发起成功页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_5_2(void)
{
	rectangle(120,150,520,230);
	puthz(130,160,"留言成功，谢谢您的参与！",32,30,8);
	puthz(210,200,"页面将在三秒后返回",24,20,8);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_8_0
参数传递：无
返回值：无
功能：绘制退出询问页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_8_0(void)
{
	setfillstyle(SOLID_FILL, YELLOW);
	bar(170,200,480,310);
	rectangle(200,245,290,285);
	rectangle(350,245,440,285);
	puthz(190,205,"您确定要退出当前帐号吗？",24,25,8);
	puthz(220,250,"确定",32,30,8);
	puthz(370,250,"算了",32,30,8);
}

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
函数名：g_2_10_0
参数传递：无
返回值：无
功能：绘制下拉菜单页面
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
void g_2_10_0(void)
{
	setfillstyle(1,WHITE);
	bar(562,19,639,50);
	bar(562,50,639,80);
	puthz(567,22,"数据统计",16,16,8);
	puthz(567,52,"使用说明",16,16,8);
}


